Test `TestAccContainerAwsNodePool_BetaBasicHandWritten` start to fail with error 
```
vcr_utils.go:152: Step 1/4 error: After applying this test step, the plan was not empty.
        stdout:
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
        -/+ destroy and then create replacement
        
        Terraform will perform the following actions:
        
          # google_container_aws_node_pool.primary must be replaced
        -/+ resource "google_container_aws_node_pool" "primary" {
              ~ create_time = "2023-07-07T15:54:42.166560Z" -> (known after apply)
              ~ etag        = "W/\"uqXf9eMWygQuZ0-39PZYuJUR-lMgb3ovt83PyQjVuJI\"" -> (known after apply)
              ~ id          = "projects/ci-test-project-188019/locations/us-west1/awsClusters/tf-test-nameukx6u9lwr6/awsNodePools/tf-test-node-pool-nameukx6u9lwr6" -> (known after apply)
                name        = "tf-test-node-pool-nameukx6u9lwr6"
              ~ reconciling = false -> (known after apply)
              ~ state       = "RUNNING" -> (known after apply)
              ~ uid         = "dfd38d61-1e0f-4a73-a188-0f45c6a2e4c1" -> (known after apply)
              ~ update_time = "2023-07-07T15:54:42.214651Z" -> (known after apply)
                # (6 unchanged attributes hidden)
        
              ~ config {
                  + image_type           = "ubuntu" # forces replacement
                    tags                 = {
                        "tag-one" = "value-one"
                    }
                    # (4 unchanged attributes hidden)
        
                  ~ root_volume {
                      ~ throughput  = 0 -> (known after apply)
                        # (4 unchanged attributes hidden)
                    }
        
                    # (5 unchanged blocks hidden)
                }
        
                # (2 unchanged blocks hidden)
            }
        
        Plan: 1 to add, 0 to change, 1 to destroy.
```
and it seems related to the change in this PR.